symbolic_math/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2019-03-27 水 22:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>数式処理演習（関西学院大学理工学部，情報科学科）</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeto R. Nishitani" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">数式処理演習（関西学院大学理工学部，情報科学科）</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5736339">1. 数式処理テキスト</a>
<ul>
<li><a href="#org0f56aad">1.1. 基礎</a></li>
<li><a href="#org1254ab7">1.2. 微積</a></li>
<li><a href="#org5dbdc0b">1.3. 線形代数</a></li>
<li><a href="#org60c25c8">1.4. 式変形</a></li>
<li><a href="#orgc8ca664">1.5. その他</a></li>
</ul>
</li>
<li><a href="#org982fffb">2. jupyter notebook 授業でのQ &amp; A</a></li>
<li><a href="#org7f49667">3. jupyter notebookのinit時の問題点</a>
<ul>
<li><a href="#orged7a9d5">3.1. 起動時のhome directory</a></li>
<li><a href="#org2a6ae51">3.2. 起動</a></li>
<li><a href="#org113b1bd">3.3. printout</a></li>
<li><a href="#orgb800fc6">3.4. init_session()でMultipleInstanceErrorがでる :: Googleだと</a></li>
<li><a href="#org926ab8c">3.5. init_session()</a></li>
<li><a href="#orgf4a589c">3.6. 解けない問題リスト</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5736339" class="outline-2">
<h2 id="org5736339"><span class="section-number-2">1</span> 数式処理テキスト</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0f56aad" class="outline-3">
<h3 id="org0f56aad"><span class="section-number-3">1.1</span> 基礎</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/first_leaf.ipynb">first_leaf.ipynb</a></li>
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/functions.ipynb">functions.ipynb</a></li>
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/equals.ipynb">equals.ipynb</a></li>
<li>課題
<ul class="org-ul">
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/group_works_1.ipynb">group_works_1.ipynb</a></li>
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/group_works_1_ans.ipynb">group_works_1_ans.ipynb</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org1254ab7" class="outline-3">
<h3 id="org1254ab7"><span class="section-number-3">1.2</span> 微積</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/differential.ipynb">differential.ipynb</a></li>
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/integral.ipynb">integral.ipynb</a></li>
<li>課題
<ul class="org-ul">
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/group_works_2.ipynb">group_works_2.ipynb</a></li>
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/group_works_2_ans.ipynb">group_works_2_ans.ipynb</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5dbdc0b" class="outline-3">
<h3 id="org5dbdc0b"><span class="section-number-3">1.3</span> 線形代数</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/linear_algebra_scipy.ipynb">linear_algebra_scipy.ipynb</a></li>
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/linear_algebra_sympy.ipynb">linear_algebra_sympy.ipynb</a></li>
<li>課題
<ul class="org-ul">
<li><a href="group_works_3.pdf">group_works_3.pdf</a></li>
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/group_works_3_breast_cancer.ipynb">group_works_3_breast_cancer.ipynb</a></li>
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/group_works_3_ans.ipynb">group_works_3_ans.ipynb</a>
<ul class="org-ul">
<li><a href="validate_A.data">validate_A.data</a>,<a href="validate_b.data">validate_b.data</a>,<a href="test_A.data">test_A.data</a>,<a href="test_b.data">test_b.data</a></li>
</ul></li>
<li><a href="group_works_4.pdf">group_works_4.pdf</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org60c25c8" class="outline-3">
<h3 id="org60c25c8"><span class="section-number-3">1.4</span> 式変形</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/equation_manipulation.ipynb">equation_manipulation.ipynb</a></li>
<li>課題
<ul class="org-ul">
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/group_works_5.pdf">group_works_5.pdf</a></li>
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/group_works_5_ans.ipynb">group_works_5_ans.ipynb</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc8ca664" class="outline-3">
<h3 id="orgc8ca664"><span class="section-number-3">1.5</span> その他</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/python_files_and_dir.ipynb">python_files_and_dir.ipynb</a></li>
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/miscellaneous.ipynb">miscellaneous.ipynb</a></li>
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/cg.ipynb">cg.ipynb</a></li>
<li><a href="https://nbviewer.jupyter.org/github/daddygongon/jupyter_num_calc/blob/master/symbolic_math/linear_solve.ipynb">linear_solve.ipynb</a></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org982fffb" class="outline-2">
<h2 id="org982fffb"><span class="section-number-2">2</span> jupyter notebook 授業でのQ &amp; A</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt>授業プリントをnbviewerで開けるとnot foundがでる</dt><dd>browserを再起動</dd>
<dt>家でやってきたのをどうすれば見れる</dt><dd>z:/に入れる</dd>
<dt>前に同じマシンでやったのは?</dt><dd>c:/users/自分のID</dd>
<dt>人シスとか，4階でやったのは？</dt><dd>残念ながら，あっちのはlogoutしたら消えます．</dd>
<dt>課題のコメントは?</dt><dd>cellの属性をmarkdownに変えて入力，latex記法が使えます．</dd>
<dt>jupyter notebookが反応しない</dt><dd>kernel, interruptかrestartを掛ける</dd>
<dt>nbviewerからipynb</dt><dd>down loadできます</dd>
<dt>nbviewerの表示が古い</dt><dd>原因はわかりません．しばらくしてから再度アクセスしてみてください．</dd>
</dl>
</div>
</div>

<div id="outline-container-org7f49667" class="outline-2">
<h2 id="org7f49667"><span class="section-number-2">3</span> jupyter notebookのinit時の問題点</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orged7a9d5" class="outline-3">
<h3 id="orged7a9d5"><span class="section-number-3">3.1</span> 起動時のhome directory</h3>
<div class="outline-text-3" id="text-3-1">
<p>
今はz:/です．先週まではlocal:/[USER ID]でした．
IV,V号館の演習室のPCでは4月いっぱいはlocal diskになっているので，
logoutすると消えちゃいます．USBに写しておいてください．来月から同じになります．
</p>
</div>
</div>

<div id="outline-container-org2a6ae51" class="outline-3">
<h3 id="org2a6ae51"><span class="section-number-3">3.2</span> 起動</h3>
<div class="outline-text-3" id="text-3-2">
<p>
書類のダブルクリックで起動できない．
</p>
</div>
</div>

<div id="outline-container-org113b1bd" class="outline-3">
<h3 id="org113b1bd"><span class="section-number-3">3.3</span> printout</h3>
<div class="outline-text-3" id="text-3-3">
<p>
IEだけでなく，Chromeでも後ろが切れるというバグがありました．
起動するbrowserをFireFoxにしたら大丈夫です．
</p>
<ol class="org-ol">
<li>Jupyter notebookのmenu barのFile-&gt;Print Previewで作って，</li>
<li>FireFoxの右上のツールボタンから印刷を選んでください．</li>
</ol>
<p>
集約して出すのを忘れずに．
</p>

<p>
集約は，出てきた画面の左上の印刷ボタンを選んで，「プロパティ」から
ワンクリック設定アイコンで集約を選択して印刷．
</p>
<ul class="org-ul">
<li>出力が半分切れるような表示になる．</li>
</ul>
</div>
</div>

<div id="outline-container-orgb800fc6" class="outline-3">
<h3 id="orgb800fc6"><span class="section-number-3">3.4</span> init_session()でMultipleInstanceErrorがでる :: Googleだと</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<a href="https://github.com/sympy/sympy/issues/13319">https://github.com/sympy/sympy/issues/13319</a>
とのことだが&#x2026; 三月ごろ修正パッチが貼られたversionがrelease?, init_print()で代用，あとkernel restart
</p>
</div>
</div>

<div id="outline-container-org926ab8c" class="outline-3">
<h3 id="org926ab8c"><span class="section-number-3">3.5</span> init_session()</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>init_session() =&gt; init_printing()</li>
</ul>
<p>
すると綺麗に出力してくれる。
</p>

<ul class="org-ul">
<li>出力が混乱してきたときは、Kernel restartで初期化するべし。</li>
</ul>
</div>
</div>


<div id="outline-container-orgf4a589c" class="outline-3">
<h3 id="orgf4a589c"><span class="section-number-3">3.6</span> 解けない問題リスト</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>16_pre 1(a) : (x**3+1)**(1/3) sqrt-&gt;cbrt (5523),</li>
<li>16_pre 2(a) : int(1/(cos(x)**2 + 4*sin(x)**2),x)</li>
<li>13-2 1(a) : int(1/(2+cos(t)),t)</li>
<li>16-1-pair 2(b)</li>
<li>rational</li>
<li>aspect ratio = 1</li>
<li>log plot, sympyはOKだが，numpyだと悲惨．</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2019-03-27 水 22:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
